using UnityEngine;

/// <summary>
/// Определяет контракт для объектов, которые можно нарезать.
/// Реализующий класс предоставляет префаб получаемых частей и логику нарезки.
/// </summary>
public interface ISliced
{
    // Префаб, используемый для создания частей после нарезки.
    public GameObject SlicedPiecePrefab { get; set; }

    /// <summary>
    /// Выполняет нарезку объекта.
    /// Конкретная реализация определяется классом, реализующим интерфейс.
    /// </summary>
    public void Slice();
}
