using UnityEngine;
/// <summary>
/// ”правл€ет состо€нием системного курсора.
///
///  репитс€ на: GameObject, который присутствует в сцене при запуске.
///
/// ѕри запуске:
/// - —крывает системный курсор.
/// - ‘иксирует курсор в центре окна приложени€.
///
/// »спользование:
/// ѕредназначен дл€ управлени€ курсором в режиме игрового управлени€
/// от первого лица или других режимах, где положение системного курсора
/// не должно отображатьс€ пользователю.
/// </summary>

public class GameCursor : MonoBehaviour
{
    void Start()
    {
        Cursor.visible = false;
        Cursor.lockState = CursorLockMode.Locked;
    }
}
